Repository: mantvydasTautkus/django_website
Catalog: mysite/smith/locale/*/LC_MESSAGES/django.po
Languages: lt

source: Item name
lt: Pavadinimas

source: Height
lt: Aukštis

source: Whith
lt: Plotis

source: Lenght
lt: Ilgis

source: Description
lt: Aprašymas

source: Price
lt: Kaina

source: main image
lt: Pagrindine nuotrauka

source: Products
lt: Gaminiai

source: Galery
lt: Galerija

source: About us
lt: Apie mus

source: Hello
lt: Labas

source: Login
lt: prisijungti

source: Register
lt: Registruotis

source: Items that are availible right now!!
lt: Prekės kurias turime sandelyje

source: log in
lt: prisijungti

source: Name:
lt: Vardas

source: Description:
lt: Aprašymas

source: Measurements:
lt: Išmatavimai

source: @mail:
lt: El. Paštas

source: Mobile:
lt: Mobilus nr.

source: width
lt: Plotis

source: length
lt: Ilgis

source: Registration
lt: Registruotis

source: User name
lt: Vartotojo vardas

source: only for pasword , no spam no shearing
lt: Slaptažodzio keitimui

source: Pasword
lt: Slaptazodis

source: At least 8 simbols
lt: Ne maziau 8 simboliu

source: Repeat pasword
lt: Pakartokite slaptazodi

source: Already registered ?
lt: Jau prisiregistrave ?

source: taken
lt: Užimtas

source: User with @mail
lt: Vartotojas su

source: allready exists
lt: Jau prisiregistrave ?

source: Passwords do not mach
lt: Slaptažodziai nesutampa
